KRX_TRADE_TIME = {
    "정규시장": {"time": ["09:00", "15:30"], "order_code": ["01", "05", "06", "12", "13", "16", "17", "61", "71", "X1", "Y1", "X5", "Y5", "X2", "Y2", "X7", "Y7"]},
    "장전시간외": {"time": ["08:30", "8:40"], "order_code": ["61"]},
    "장후시간외": {"time": ["15:40", "16:00"], "order_code": ["71"]},
    "시간외단일가": {"time": ["16:00", "18:00"], "order_code": ["81"]},
}

NXT_TRADE_TIME = {
    "프리마켓": {"time": ["08:00", "8:50"], "order_code": ["61"]},
    "메인마켓": {"time": ["09:00", "15:20"], "order_code": ["01", "12", "13", "16", "17", "N7", "X1", "Y1", "X5", "Y5", "X2", "Y2", "X7", "Y7"]},
    "종가매매시장": {"time": ["15:00", "15:30"], "order_code": ["N7"]},
    "종가매매 체결시작": {"time": ["15:30", "16:00"], "order_code": ["N7", "01", "12", "13"]},
    "애프터마켓": {"time": ["15:30", "20:00"], "order_code": ["01"]},
}

SOR_TRADE_TIME = {
    "스마트주문": {"time": ["09:00", "18:00"], "order_code": ["01", "12", "13", "X1", "Y1", "X5", "Y5", "X2", "Y2"]},
}

ORDER_CODE = {
    "01": "보통가(지정가)",
    "05": "시장가",
    "06": "조건부지정가",
    "12": "최유리지정가",
    "13": "최우선지정가",
    "61": "장전시간외",
    "71": "장후시간외",
    "N7": "종가매매",
    "X1": "IOC보통가",
    "Y1": "FOK보통가",
    "X5": "IOC시장가",
    "Y5": "FOK시장가",
    "X2": "IOC최유리",
    "Y2": "FOK최유리",
    "09": "자사주",
    "16": "스톱지정가",
    "17": "중간가",
    "X7": "IOC중간가",
    "Y7": "FOK중간가",
    "81": "시간외단일가",
}

NEED_PRICE = ["01", "06", "X1", "Y1", "09", "16", "81"]
NO_NEED_PRICE = ["05", "12", "13", "61", "71", "N7", "X5", "Y5", "X2", "Y2", "17", "X7", "Y7"]
